function μij(k1, k2, k3)
    return 0.5 .* (k3.^2 .- k1.^2 .- k2.^2) ./ (k1 .* k2)
end

function compute_I_abc(a::Int64, b::Int64, c::Int64, k::Matrix)

    if b > 4
        throw(DomainError(b, "abc must 0, 1, 2, 3, or 4"))
    elseif c > 4
        throw(DomainError(c, "abc must 0, 1, 2, 3, or 4"))
    end

    k1, k2, k3 = k[:,1], k[:,2], k[:,3]
    μ123 = μij(k1, k2, k3)
    
    #Tutti i casi
    if b == 0
        #a0c
        if c == 0 #a00
            a_oddeven = (1. + (-1.)^a) * 0.5
            return a_oddeven / (1. + a)
        elseif c == 1 #a01
            a_oddeven = (-1. + (-1.)^a) * 0.5
            return a_oddeven .* (k1 .+ k2 .* μ123) ./ ((2 + a) .* k3)
        elseif c == 2 #a02
            a_oddeven = (1. + (-1.)^a) * 0.5
            return a_oddeven .* ((1 + a) .* k1.^2 .+ 
                                 2 .* (1 + a) .* k1 .* k2 .* μ123 .+
                                 k2.^2 .* (1 .+ a .* μ123.^2)) ./ 
                   ((1 + a) .* (3 + a) .* k3.^2)
        elseif c == 3 #a03
            a_oddeven = (-1. + (-1.)^a) * 0.5
            return a_oddeven .* (k1 .+ k2 .* μ123) .* ((2 + a) .* k1.^2 .+
                                                       2 .* (2 + a) .* k1 .* k2 .* μ123 .+
                                                       k2.^2 .* (3 .+ (a - 1) .* μ123.^2)) ./
                   ((2 + a) .* (4 + a) .* k3.^3)
        elseif c == 4 #a04
            a_oddeven = (1. + (-1.)^a) * 0.5
            return a_oddeven .* ((1 + a) .* (3 + a) .* k1.^4 .+
                                 4 .* (1 + a) .* (3 + a) .* k1.^3 .* k2 .* μ123 .+
                                 4 .* (1 + a) .* k1 .* k2.^3 .* μ123 .* (3 .+ a .* μ123.^2) .+
                                 6 .* k1.^2 .* k2.^2 .* (1 .+ a .+ (1 + a) .* (2 + a) .* μ123.^2) .+
                                 k2.^4 .* (3 .+ 6 .* a .* μ123.^2 + (a - 2) .* a .* μ123.^4)) ./
                   ((1 + a) .* (3 + a) .* (5 + a) .* k3.^4)
        end

    elseif b == 1
        #a1c
        if c == 0 #a10
            a_oddeven = (-1. + (-1.)^a) * 0.5
            return -1 .* a_oddeven .* μ123 ./ (2 + a)
        elseif c == 1 #a11
            a_oddeven = (1. + (-1.)^a) * 0.5
            return -1 .* a_oddeven .* (k2 .+ 
                                       (1 + a) .* k1 .* μ123 .+
                                       a .* k2 .* μ123.^2) ./
                   ((1 + a) .* (3 + a) .* k3)
        elseif c == 2 #a12
            a_oddeven = (-1. + (-1.)^a) * 0.5
            return -1 .* a_oddeven .* ((2 + a) .* k1.^2 .* μ123 .+
                                       k2.^2 .* μ123 .* (3 .+ (a -1) .* μ123.^2) .+
                                       2 .* k1 .* (k2 .+ (1 + a) .* k2 .* μ123.^2)) ./
                   ((2 + a) .* (4 + a) .* k3.^2)
        elseif c == 3 #a13
            a_oddeven = (1. + (-1.)^a) * 0.5
            return -1 .* a_oddeven .* ((1 + a) .* (3 + a) .* k1.^3 .* μ123 .+
                                       3 .* (1 + a) .* k1 .* k2.^2 .* μ123 .* (3 .+ a .* μ123.^2) .+
                                       3 .* k1.^2 .* k2 .* (1 .+ a .+ (1 + a) .* (2 + a) .* μ123.^2) .+
                                       k2.^3 .* (3 .+ 6 .* a .* μ123.^2 .+ (a - 2) .* a .* μ123.^4)) ./
                   ((1 + a) .* (3 + a) .* (5 + a) .* k3.^3)
        elseif c == 4 #14
            a_oddeven = (-1. + (-1.)^a) * 0.5
            return -1 .* a_oddeven .* ((2 + a) .* (4 + a) .* k1.^4 .* μ123 .+
                                       4 .* k1.^3 .* k2 .* (2 .+ a .+ (2 + a) .* (3 + a) .* μ123.^2) .+
                                       6 .* (2 + a) .* k1.^2 .* k2.^2 .* μ123 .* (3 .+ (1 + a) .* μ123.^2) .+
                                       4 .* k1 .* k2.^3 .* (3 .+ 6 .* (1 + a) .* μ123.^2 .+ (a^2 - 1) .* μ123.^4) .+
                                       k2.^4 .* μ123 .* (15 .+ (a - 1) .* μ123.^2 .* (10 .+ (a - 3) .* μ123.^2))) ./
                   ((2 + a) .* (4 + a) .* (6 + a) .* k3.^4) 
        end 

    elseif b == 2
        #a2c
        if c == 0 #a20
            a_oddeven = (1. + (-1.)^a) * 0.5
            return a_oddeven .* (1 .+ a .* μ123.^2) ./ ((1 + a) * (3 + a))
        elseif c == 1 #a21
            a_oddeven = (-1. + (-1.)^a) * 0.5
            return a_oddeven .* (k1 .+
                                 (1 + a) .* k1 .* μ123.^2 .+
                                 k2 .* μ123 .* (3 .+ ( a - 1) .* μ123.^2)) ./
                   ((2 + a) .* (4 + a) .* k3)
        elseif c == 2 #a22
            a_oddeven = (1. + (-1.)^a) * 0.5
            return a_oddeven .* (k1.^2 .* (1 .+ a .+ (1 + a) .* (2 + a) .* μ123.^2) .+
                                 2 .* (1 + a) .* k1 .* k2 .* μ123 .* (3 .+ a .* μ123.^2) .+
                                 k2.^2 .* (3 .+ 6 .* a .* μ123.^2 .+ (a - 2) .* a .* μ123.^4)) ./
                   ((1 + a) .* (3 + a) .* (5 + a) .* k3.^2)
        elseif c == 3 #a23
            a_oddeven = (-1. + (-1.)^a) * 0.5
            return a_oddeven .* (k1.^3 .* (2 .+ a .+ (2 + a) .* (3 + a) .* μ123.^2) .+
                                 3 .* (2 + a) .* k1.^2 .* k2 .* μ123 .* (3 .+ (1 + a) .*μ123.^2) .+
                                 3 .* k1 .* k2.^2 .* (3 .+ 6 .* (1 + a) .* μ123.^2 + (a.^2 - 1) .* μ123.^4) .+
                                 k2.^3 .* μ123 .* (15 .+ (a - 1) .* μ123.^2 .* (10 .+ (a - 3) .* μ123.^2))) ./
                   ((2 + a) .* (4 + a) .* (6 + a) .* k3.^3)
        elseif c == 4 #a24
            throw(DomainError(c, "we do not have a24, what are you doing freak?"))
        end

    elseif b == 3
        #a3c
        if c == 0 #a30
            a_oddeven =(-1. + (-1.)^a) * 0.5
            return -1 .* a_oddeven .* (μ123 .* (3 .+ (a -1) .* μ123.^2)) ./ ((2 + a) * (4 + a))
        elseif c == 1 #a31
            a_oddeven =(1. + (-1.)^a) * 0.5
            return -1 .* a_oddeven .* ((1 + a) .* k1 .* μ123 .* (3 .+ a .* μ123.^2) .+
                                       k2 .* (3 .+ 6 .* a .* μ123.^2 .+ (a - 2) .* a .* μ123.^4)) ./
                   ((1 + a) .* (3 + a) .* (5 + a) .* k3)
        elseif c == 2 #a32
            a_oddeven =(-1. + (-1.)^a) * 0.5
            return -1 .* a_oddeven .* ((2 + a) .* k1.^2 .* μ123 .* (3 .+ (1 + a) .* μ123.^2) .+
                                       2 .* k1 .* k2 .* (3 .+ 6 .* (1 + a) .* μ123.^2 .+ (a^2 - 1) .* μ123.^4) .+
                                       k2.^2 .* μ123 .* (15 .+ (a -1) .* μ123.^2 .* (10 .+ (a - 3) .* μ123.^2))) ./
                   ((2 + a) .* (4 + a) .* (6 + a) .* k3.^2)
        elseif c == 3 #a33
            throw(DomainError(c, "we do not have a33, what are you doing freak?"))
        elseif c == 4 #a34
            a_oddeven =(-1. + (-1.)^a) * 0.5
            return -1 .* a_oddeven .* ((2 + a) .* (4 + a) .* k1.^4 .* μ123 .* (3 .+ (3 + a) .* μ123.^2) .+
                                       4 .* (2 + a) .* k1.^3 .* k2 .* (3 .+ (3 + a) .* μ123.^2 .* (6 .+ (1 + a) .* μ123.^2)) .+
                                       6 .* (2 + a) .* k1.^2 .* k2.^2 .* μ123 .* (15 .+ 
                                                                                  10 .* (1 + a) .* μ123.^2 .+ 
                                                                                  (a^2 - 1) .* μ123.^4) .+
                                       4 .* k1 .* k2.^3 .* (15 .+ (1 + a) .* μ123.^2 .*
                                                            (45 .+ (a - 1) .* μ123.^2 .*
                                                             (15 .+ (a - 3) .* μ123.^2))) .+
                                       k2.^4 .* μ123 .* (105 .+ (a - 1) .* μ123.^2 .* 
                                                         (105 .+ (a - 3) .* μ123.^2 .*
                                                          (21 .+ (a - 5) .* μ123.^2)))) ./
                   ((2 + a) .* (4 + a) .* (6 + a) .* (8 + a) .* k3.^4)
        end

    elseif b == 4
        #a4c
        if c == 0 #a40
            a_oddeven = (1. + (-1.)^a) * 0.5
            return a_oddeven .* ((a - 2) .* a .* μ123.^4 + 6 .* a .* μ123.^2 .+ 3) ./ ((1 + a) * (3 + a) * (5 + a))
        elseif c == 1 #a41
            a_oddeven = (-1. + (-1.)^a) * 0.5
            return a_oddeven .* (k1 .* (3 .+ 6 .* (1 + a) .* μ123.^2 .+ (a^2 - 1) .* μ123.^4) .+
                                 k2 .* μ123 .* (15 .+ (a - 1) .* μ123.^2 .* (10 .+ (a - 3) .* μ123.^2))) ./
                   ((2 + a) .* (4 + a) .* (6 + a) .* k3)
        elseif c == 2 #a42
            throw(DomainError(c, "we do not have a42, what are you doing freak?"))
        elseif c == 3 #a43
            a_oddeven = (-1. + (-1.)^a) * 0.5
            return a_oddeven .* ((2 + a) .* k1.^3 .* (3 .+ (3 + a) .* μ123.^2 .* (6 .+ (1 + a) .* μ123.^2)) .+
                                 3 .* (2 + a) .* k1.^2 .* k2 .* μ123 .* (15 .+ 
                                                                         10 .* (1 + a) .* μ123.^2 .+
                                                                         (a^2 - 1) .* μ123.^4) .+
                                 3 .* k1 .* k2.^2 .* (15 .+ (1 + a) .* μ123.^2 .*
                                                      (45 .+ (a - 1) .* μ123.^2 .*
                                                       (15 .+ (a - 3) .* μ123.^2))) .+
                                 k2.^3 .* μ123 .* (105 .+ (a - 1) .* μ123.^2 .*
                                                   (105 .+ (a - 3) .* μ123.^2 .*
                                                    (21 .+ (a - 5) .* μ123.^2)))) ./
                   ((2 + a) .* (4 + a) .* (6 + a) .* (8 + a) .* k3.^3)
        elseif c == 4 #a44
            throw(DomainError(c, "we do not have a44, what are you doing freak?"))
        end

    end

end

function get_Is(k::Matrix; na::Int64=9, nb::Int64=5, nc::Int64=5)
    #initialise array of zeros
    I_abc = zeros(na, nb, nc, length(k[:,1]))

    for α in 0:na-1
        for β in 0:nb-1
            for γ in 0:nc-1
                #println("$α $β $γ")
                if (β == 2 && γ == 4)
                    I_abc[α+1,β+1,γ+1,:] .= -99.
                elseif (β == 3 && γ == 3)
                    I_abc[α+1,β+1,γ+1,:] .= -99.
                elseif (β == 4 && γ == 2)
                    I_abc[α+1,β+1,γ+1,:] .= -99.
                elseif (β == 4 && γ == 4)
                    I_abc[α+1,β+1,γ+1,:] .= -99.
                else
                    I = compute_I_abc(α, β, γ, k)
                    I_abc[α+1,β+1,γ+1,:] .= I
                end
            end
        end
    end

    return I_abc
end

function read_Is_matrix(α, β, γ, Is, ℓ)
    return Is[α+1+ℓ, β+1+ℓ, γ+1+ℓ,:]
end